# # -- Lesson 11
# # -- Множини
#
# # -- Список перетворюємо у множину і позбуваємось елементів, що повторюються
#
# # -- Перетворюємо стрічку у словник з елементів, що не повторюються та росташовані у випадковому порядку
#
# data = 'hello'
# listData = set(data)
# print(listData)
#
# #-----------------------------
# data = set('hello')
# print(data)
#
#
# # -------------------------------------- Створюємо множину
# dataTwo = {5, 5, 7, 7, 4, 4}
# print(dataTwo)
# dataTwo.add(32)
# print(dataTwo)
# #----------------------------------------- Додаємо список до множини
# dataTwo.update([6, 9, 10])
# print(dataTwo)

# ----------------------------------------Додаємо елемент до множини
# dataThrее = {5, 7, 4, 3, 5}
# print(dataThrее)
# dataThrее.add(32)
#
# # ----------------------------------------Видаляємо елемент з множини
# print(dataThrее)
# dataThrее.remove(32)
# print(dataThrее)
# # ----------------------------------------Видаляємо  перший елемент з множини
# dataThrее.pop()
# print(dataThrее)
# # --------------------------------------- Очищення множини
# dataThrее.clear()
# print(dataThrее)
#----------------------------------------- Перетворюємо список у множину
nums=[5, 7, 3, 5, 5]
print(nums)
new_nums=set(nums)
print(new_nums)

# ---------------------------------------- Перетворюємо множину у кортеж
new_data=frozenset([5, 7, 3, 5, 5, 5, 5, 7, 7, 4, 4])
print(new_data)









