#---відкриваємо файл, а якщо такого немає,
# створюємо його

#---------------------------- 'w' --перезаписуємо

# file = open('files/text.text', 'w')
# # 'w'  - режим відкривання файлу з заміною інф
#
# # write - Записуємо у файл (перед цим стриаємо)
# file.write('Hello Ivan')
# file.write('\n')
# file.write('welcome to 2024')
#
# # одразу закриваємо файл
# file.close()

# ----------------------------------------
# file = open('files/text.text', 'a')
# # 'а'  - режим відкривання файлу з додаванням інф
#
# # write - ---Записуємо у файл (перед цим стриаємо)
# file.write('Hello Ivan')
# file.write('\n')
# file.write('welcome to 2024')
# file.write('\n')
#
# ---------------- одразу закриваємо файл
# file.close()
# ------------------------------------------------
#------------------------------- 'a' - додаємо
# file = open('files/text.text', 'a')
# data = input("Введіть ваше ім'я:")
#
# file.write(data + "\n")
#
# file.close()
#------------------------------------------------

#------------------------------------------------
#------------------------------------------------
# ///////////////  Читаємо данні  з файла
# --------------------------'r' -- читаємо
#--------- Відкриваємо
file = open('files/text.text', 'r')

#----------Читаємо
# # ------ в дужках Можемо вказати число символів,
# # що виводяться у повідомлення
#
# print(file.read(10))
#
# #----------Закриваємо
# file.close()

# --------------------------'r' -- читаємо
#--------- Відкриваємо
file = open('files/text.text', 'r')

#----------Читаємо по стрічно
for line in file:
#-------------- з переводом стрічок
    # print(line)
#----------------або без переводу стрічок
    print(line, end="")
#----------Закриваємо
file.close()



